# s = "1001/1002/1003"
# print(s.split('/')) 

# a=["1001","1002","1003"]
# print('1006' in a)

import pandas as pd

# # 创建两个时间戳
# time1 = pd.Timestamp('2025-03-01 00:00:00')
# time2 = pd.Timestamp('2026-01-01 00:00:00')

# # 直接比较
# print(time1 <= time2)   # True


# a='3001'
# print(a[0])

# result={
#     '1':{
#         'hasRentArea':23,
#         'nothasRentArea':232,
#     },
#     '2':{
#         'hasRentArea':12,
#         'nothasRentArea':234,
#     },
#     '3':{
#         'hasRentArea':12,
#         'nothasRentArea':234,
#     }
# }

a={
    '档口号':5,
    '面积':7,
    '租金':8
}
df=[a['面积']]
print(df)

list=[[
        "2025-01-31",
        "记-1",
        "收商户2025年1月租金及管理费",
        "1001001",
        "库存现金 - 现金",
        "59205",
        "0"
    ],
[
        "2025-01-31",
        "记-1",
        "收商户2025年1月租金及管理费",
        "1002002",
        "银行存款 - 九江银行5870 2970 0000 0012 48",
        "152183",
        "0"
    ],
[
        "2025-01-31",
        "记-1",
        "收商户2025年1月租金及管理费",
        "6001001",
        "主营业务收入 - 租金收入",
        "0",
        "666485"
    ],
[
        "2025-01-31",
        "记-1",
        "收商户2025年1月租金及管理费",
        "6001003",
        "主营业务收入 - 管理费收入",
        "0",
        "259335"
    ]]
# print(list)

print(list[2][3])
